///////////////////////////////////////////////////////////////////////////////////////////////////
/// ___________       __          _________            .___    __________          __           ///
/// \_   _____/____  |  | __ ____ \_   ___ \  ____   __| _/____\______   \___.__._/  |_  ____   ///
///  |    __) \__  \ |  |/ // __ \/    \  \/ /  _ \ / __ |/ __ \|    |  _<   |  |\   __\/ __ \  ///
///  |     \   / __ \|    <\  ___/\     \___(  <_> ) /_/ \  ___/|    |   \\___  | |  | \  ___/  ///
///  \___  /  (____  /__|_ \\___  >\______  /\____/\____ |\___  >______  // ____| |__|  \___  > ///
///      \/        \/     \/    \/        \/            \/    \/       \/ \/                \/  ///
///                                    (c)FakeCodeByte                                          ///
///////////////////////////////////////////////////////////////////////////////////////////////////
#include <stdio.h>
#include <string.h>
#include <stdbool.h>

bool Palindrom(char* input){

	int r = strlen(input)-1;
    int i;
	
	for(i=0; i<r/2; i++){
		r--;
		if(input[i]!=input[r])
			return false;
	}
	return true;
}


int main(){
	char string[256]="";
	printf("Введите строку:");
	
	int index = 0;
    int letter;

    while ((letter = getchar ( )) != '\n') 
	string [index++] = letter;

    string[index] = '0';
	
	if (Palindrom(string) == true) 
		printf("TRUE");
	else 
		printf("false");
	
	return 0;
}