///////////////////////////////////////////////////////////////////////////////////////////////////
/// ___________       __          _________            .___    __________          __           ///
/// \_   _____/____  |  | __ ____ \_   ___ \  ____   __| _/____\______   \___.__._/  |_  ____   ///
///  |    __) \__  \ |  |/ // __ \/    \  \/ /  _ \ / __ |/ __ \|    |  _<   |  |\   __\/ __ \  ///
///  |     \   / __ \|    <\  ___/\     \___(  <_> ) /_/ \  ___/|    |   \\___  | |  | \  ___/  ///
///  \___  /  (____  /__|_ \\___  >\______  /\____/\____ |\___  >______  // ____| |__|  \___  > ///
///      \/        \/     \/    \/        \/            \/    \/       \/ \/                \/  ///
///                                    (c)FakeCodeByte                                          ///
///////////////////////////////////////////////////////////////////////////////////////////////////

#include <stdio.h>
#include <string.h>

void SecVens(char LText[25], char RText[25]){
	
	char Result[50];
	int i,k=strlen(LText);

	for(i=0; i<strlen(LText); i++){
		Result[i] = LText[i];
		Result[k] = RText[i];
		k++;
	}
	
	printf("\nРезультат: %s",Result);
}

int main(){
	
	char LText[25], RText[25];
	
	printf("Введите первую строку: ");
	gets(LText);
	printf("\nВведите вторую строку: ");
	gets(RText);
	
	SecVens(LText,RText);
	
	return 0;
}